In [19]:
import pandas as pd
import numpy as np
df = pd.read_csv('icecreamsales.csv')
df

    Temperature  Sales
0            37    292
1            40    228
2            49    324
3            61    376
4            72    440
5            79    496
6            83    536
7            81    556
8            75    496
9            64    412
10           53    324
11           40    320

In [20]:
df.count()

Temperature    12
Sales          12
dtype: int64

In [21]:
df.sum()

Temperature     734
Sales          4800
dtype: int64

In [22]:
df.sum(skipna=True)

Temperature     734
Sales          4800
dtype: int64

In [23]:
print(df['Sales'], '\n')
print(df['Sales'].mean())
print(df['Sales'].median())
print(df['Sales'].mode())
print(df['Sales'].min())
print(df['Sales'].max())
print(df['Sales'].product())
print(df['Sales'].std())
print(df['Sales'].var())
print(df['Sales'].sem())
print(df['Sales'].skew())
print(df['Sales'].kurt())
print(df['Sales'].quantile())
print(df['Sales'].cumsum())
print(df['Sales'].cumprod())
print(df['Sales'].cummax())
print(df['Sales'].cummin())
print(df['Sales'].describe())

0     292
1     228
2     324
3     376
4     440
5     496
6     536
7     556
8     496
9     412
10    324
11    320
Name: Sales, dtype: int64

400.0
394.0
0    324
1    496
Name: Sales, dtype: int64
228
556
4582080946295013376
105.65122724408751
11162.181818181818
30.498882244794125
0.036552031682046925
-1.2179973006069797
394.0
0      292
1      520
2      844
3     1220
4     1660
5     2156
6     2692
7     3248
8     3744
9     4156
10    4480
11    4800
Name: Sales, dtype: int64
0                     292
1                   66576
2                21570624
3              8110554624
4           3568644034560
5        1770047441141760
6      948745428451983360
7    -7453119918274248704
8    -7398664722117033984
9    -4537093350141984768
10    5721280450761064448
11    4582080946295013376
Name: Sales, dtype: int64
0     292
1     292
2     324
3     376
4     440
5     496
6     536
7     556
8     556
9     556
10    556
11    556
Name: Sales, dtype: int64
0     292
1     228
2     228
3     228
4     228
5     228
6     228
7     228
8     228
9     228
10    228
11    228
Name: Sales, dtype: int64
count     12.000000
mean     400.000000
std      105.651227
min      228.000000
25%      323.000000
50%      394.000000
75%      496.000000
max      556.000000
Name: Sales, dtype: float64

In [24]:
ser = pd.Series(data=[
    2, 3, 3, 4, 4, 4, 5, 5, 5, 5, 6,6,6,6,6, 7,7,7,7,7,7, 8,8,8,8,8, 9,9,9,9,10,10,10, 11, 11, 12
])

In [25]:
ser.value_counts()

7     6
6     5
8     5
5     4
9     4
4     3
10    3
3     2
11    2
2     1
12    1
Name: count, dtype: int64

In [26]:
### create a dictionary
dict = {'one': pd.Series([1.,2.,3.], index=['a','b','c']), 
        'two': pd.Series([1.,2.,3.,4.], index=['a','b','c','d'])
       }

### create a dataframe from the dictionary
df = pd.DataFrame(dict)
print(df, '\n')
df.fillna(0)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  0.0  4.0

In [27]:
df.agg(np.mean)

/var/folders/6t/bfp06fh96wn60n_mjtxmbhfm0000gn/T/ipykernel_4856/1193103369.py:1: FutureWarning: The provided callable <function mean at 0x10acefb00> is currently using DataFrame.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  df.agg(np.mean)

one    2.0
two    2.5
dtype: float64

In [28]:
df.agg('mean')

one    2.0
two    2.5
dtype: float64

In [29]:
df.agg(['mean', 'std'])

      one       two
mean  2.0  2.500000
std   1.0  1.290994